[
    {
        "image": "/assets/image/sysmap_solutions_logo.jpeg",
        "company": "SysMap Solutions",
        "position": "Software Developer",
        "period": "Oct 2024 - Present",
        "achievements": [
            "• Increased system reliability by 20% and reduced API response time by 15% by designing secure, containerized microservices using Spring Boot, JWT, OAuth, and Docker.",
            "• Led the implementation of scalable microservices with Docker and Kubernetes, improving portability and operational efficiency.",
            "• Ensured 85% compliance with industry standards and reduced integration errors by 20% by leading the end-to-end architecture and technical documentation aligned with TMForum and OpenAPI.",
            "• Optimized CI/CD pipelines, reducing deployment time by 25% and cutting release downtime by 15%, leveraging Docker, Kubernetes, and DevOps best practices."
        ],
        "context": "I design, develop, and document distributed systems, ensuring compliance with industry standards. I work with Docker and Kubernetes for containerization and scalability while collaborating with cross-functional teams to optimize integration, monitoring, and production support.",
        "technologies": [
            "• Java",
            "• Spring Boot",
            "• Azure",
            "• Docker",
            "• Kafka",
            "• JUnit, Mockito",
            "• CI/CD tools"
        ],
        "activities": [
            "• Designed and developed secure APIs and microservices, integrating JWT, OAuth, and Docker for authentication and scalability.",
            "• Led technical documentation efforts, ensuring compliance with TMForum and OpenAPI standards.",
            "• Managed cross-functional teams, focusing on integration delivery, troubleshooting, and production support.",
            "• Optimized CI/CD pipelines, reducing deployment time by 25% and release downtime by 15%.",
            "• Implemented distributed systems using Kafka and Docker, enhancing system reliability and scalability."
        ]
    },
    {
        "image": "/assets/image/sysmap_solutions_logo.jpeg",
        "company": "SysMap Solutions",
        "position": "Junior Software Developer",
        "period": "Sep 2022 - Sep 2024",
        "achievements": [
            "• Migrated 20GB of data daily between academic systems using Kafka, Kubernetes, and Docker, increasing operational throughput by 15% and reducing latency by 20%.",
            "• Promoted to team leader after one year, managing critical deployments, optimizing service integrations, and reducing incident resolution time by 75%.",
            "• Implemented automated CI/CD pipelines with Docker, achieving 65% on-time deliveries and improving system stability and efficiency.",
            "• Boosted team productivity by 40% by optimizing workflows and prioritizing strategic tasks, fostering better collaboration."
        ],
        "context": "I was responsible for large-scale data migration and internal process optimization, leveraging Kafka, Kubernetes, and Docker to enhance operational efficiency. Later, I led a team, managing strategic deliveries and improving cross-team collaboration.",
        "technologies": [
            "• Kafka",
            "• Kubernetes",
            "• ksqlDB",
            "• Oracle",
            "• SQL Server"
        ],
        "activities": [
            "• Led the migration of large-scale datasets across systems using Kafka and Kubernetes, increasing throughput by 15% and reducing latency by 20%.",
            "• Promoted to team leader, overseeing production deliveries, improving incident resolution time by 75%, and driving cross-team collaboration.",
            "• Implemented workflow optimizations and strategic task prioritization, boosting team productivity by 40%.",
            "• Developed automated deployment pipelines using Docker and CI/CD, improving system efficiency and release consistency."
        ]
    },
    {
        "image": "/assets/image/ciedsbrasil_logo.jpeg",
        "company": "CIEDS",
        "position": "UX/UI Designer",
        "period": "Aug 2022 - Sep 2022",
        "achievements": [
            "• Successfully led a website redesign project, creating user flows, wireframes, and prototypes in Figma, which increased stakeholder satisfaction by 30%.",
            "• Prioritized mobile responsiveness and accessibility by delivering 15 high-fidelity wireframes and 3 interactive prototypes, resulting in a 25% decrease in implementation time.",
            "• Conducted user testing, uncovering a 40% improvement in task completion rates, ensuring an intuitive and user-friendly experience."
        ],
        "context": "CIEDS is a social nonprofit institution, voted 67th Best NGO in the world and 3rd Best NGO in Brazil (NGO Advisor). We build networks for the prosperity of people, communities, and society based on knowledge, cooperation, and empowerment. We understand prosperity as better health, better food, better income, respect for one another and the environment, and, above all, confidence in our future.",
        "technologies": [
            "• Figma"
        ],
        "activities": [
            "• Designed user flows and developed wireframes and prototypes to enhance the website's interface.",
            "• Delivered high-fidelity wireframes and interactive prototypes, prioritizing mobile responsiveness and accessibility.",
            "• Conducted user testing to assess design effectiveness, leading to significant improvements in task completion rates."
        ]
    },
    {
        "image": "/assets/image/lojas_quero_quero_s_a_logo.jpeg",
        "company": "Lojas Quero-Quero S.A.",
        "position": "Web Development Intern",
        "period": "Jan 2022 - Apr 2022",
        "achievements": [
            "• Automated purchase processes by 40% through CSV integration, utilizing Node.js, Python, Docker, and CI/CD.",
            "• Optimized system code and monitoring, reducing downtime by 15% and improving loading speed by 20%.",
            "• Contributed to full-stack development, increasing team productivity by 10% and improving system reliability."
        ],
        "context": "I worked on full-stack development and process automation, focusing on efficient integrations and system performance optimization using Docker and monitoring tools.",
        "technologies": [
            "• Node.js",
            "• Python",
            "• HTML5",
            "• CSS3",
            "• JavaScript"
        ],
        "activities": [
            "• Gained hands-on experience in full-stack development, working with Node.js, Python, Docker, and CI/CD pipelines.",
            "• Developed and maintained automated processes, improving system efficiency and reducing downtime by 15%.",
            "• Optimized code performance, enhancing system reliability and increasing team productivity by 10%.",
            "• Contributed to real-world projects, reinforcing best practices in software development and system optimization."
        ]
    }
]